import joblib


def get_hero_data():
    hero_data = {}

    hero_data[
        "上路"
    ] = "亚连、白起、扁鹊、曹操、嫦娥、程咬金、达摩、赵怀真、姬小满、夏洛特、司空震、云缨、典韦、貂蝉、东皇太一、宫本武藏、花木兰、橘右京、梦奇、铠、狂铁、兰陵王、老夫子、李信、廉颇、刘邦、刘禅、吕布、澜、蒙恬、芈月、明世隐、墨子、哪吒、苏烈、孙策、孙悟空、夏侯惇、项羽、亚瑟、杨戬、曜、张飞、钟馗、钟无艳、猪八戒、庄周、赵云".split(
        "、"
    )
    hero_data[
        "中路"
    ] = "安琪拉、百里守约、扁鹊、不知火舞、嫦娥、姬小满、妲己、貂蝉、干将莫邪、高渐离、宫本武藏、姜子牙、金蝉、海月、米莱迪、墨子、女娲、上官婉儿、沈梦溪、司马懿、孙膑、太乙真人、王昭君、西施、小乔、杨玉环、瑶、弈星、张良、甄姬、钟馗、周瑜、诸葛亮、嬴政、武则天".split(
        "、"
    )
    hero_data[
        "下路"
    ] = "艾琳、百里守约、嫦娥、成吉思汗、夏洛特、司空震、狄仁杰、伽罗、公孙离、后羿、花木兰、黄忠、狂铁、兰陵王、老夫子、李信、李元芳、鲁班七号、马可波罗、莱西奥、戈娅、蒙犽、孙尚香、虞姬、嬴政".split(
        "、"
    )
    hero_data[
        "打野"
    ] = "亚连、阿古朵、阿轲、白起、百里玄策、曹操、嫦娥、达摩、赵怀真、姬小满、司空震、云缨、典韦、貂蝉、干将莫邪、宫本武藏、韩信、镜、橘右京、梦奇、铠、兰陵王、李白、李元芳、廉颇、刘邦、刘备、露娜、澜、暃、娜可露露、盘古、裴擒虎、司马懿、孙策、孙悟空、夏侯惇、雅典娜、亚瑟、曜、云中君、钟无艳、诸葛亮、猪八戒、庄周、赵云、杨玉环".split(
        "、"
    )
    hero_data[
        "游走"
    ] = "安琪拉、扁鹊、蔡文姬、达摩、妲己、大乔、典韦、东皇太一、盾山、鬼谷子、姜子牙、兰陵王、金蝉、廉颇、刘邦、刘禅、桑启、鲁班大师、米莱迪、明世隐、墨子、牛魔、苏烈、孙膑、太乙真人、王昭君、西施、夏侯惇、项羽、瑶、张良、钟馗、庄周".split(
        "、"
    )
    # joblib.dump(hero_data, "hero_data.pkl")
    return hero_data
